docs/site/jordan18_perfor_live_elect.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-10 Mon 22:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>jordan18_perfor_live_elect</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">jordan18_perfor_live_elect</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org333d8a1">Performing Live with Electronics</a>
<ul>
<li><a href="#org82c938d">Lack of training</a></li>
<li><a href="#org11770fa">List of equipment for electroacoustic music performance</a></li>
<li><a href="#org27eb233">More eq</a></li>
<li><a href="#org5f85c71">Appearances</a></li>
<li><a href="#org8fe13db">Speaker placement</a></li>
<li><a href="#orgcc75fcc">Tape</a></li>
<li><a href="#org8f13a60">Practicing</a></li>
<li><a href="#org3ff97a4">Tape first</a></li>
<li><a href="#orga35fbac">Computer for effects</a></li>
<li><a href="#org3cd9f72">Delay mistakes</a></li>
<li><a href="#org9952322">Max vs others</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org333d8a1" class="outline-2">
<h2 id="org333d8a1">Performing Live with Electronics</h2>
<div class="outline-text-2" id="text-org333d8a1">
</div>

<div id="outline-container-org82c938d" class="outline-3">
<h3 id="org82c938d">Lack of training</h3>
<div class="outline-text-3" id="text-org82c938d">
<p>
Since there is no performance practice students that are more technologically inclined learn through experimentation instead of formal learning.
</p>
</div>
</div>

<div id="outline-container-org11770fa" class="outline-3">
<h3 id="org11770fa">List of equipment for electroacoustic music performance</h3>
<div class="outline-text-3" id="text-org11770fa">
<p>
Mac or PC (linux for pd maybe) running a modern operating system.
The faster the processor the lower the latency.
Recommended 8GB of ram and an ssd.
</p>

<p>
Recommended Apple MacBook Pro, and Microsoft Surface Laptop
</p>

<p>
Audio interface with at least 2 mic preamps and 4 1/4" audio outputs.
This helps with phantom power. It also handles low buffer sizes for latency.
Recommended Presonus Studio 2/6, Focusrite Scarlett 2i4, Behringer UMC204HD
</p>
</div>
</div>

<div id="outline-container-org27eb233" class="outline-3">
<h3 id="org27eb233">More eq</h3>
<div class="outline-text-3" id="text-org27eb233">
<p>
PA speakers
High quality is important to reproduce all of 20Hz to 20kHz.
Recommended Presonus Air 12 and Mackie SRM450v3
Subwoofers may be necessary if there is lots of low stuff.
</p>

<p>
Cardioid Condenser mics
Recommended Rode NT-5, Shure KSM137, Audio-Technica AT2035
</p>

<p>
In ear monitors
Wired or wireless
This is for staying in sync with tracks. Bluetooth has too high latency for this to be viable.
Recommended Shure PSM300 (wireless) or Behringer P2 (wired)
</p>

<p>
Audio software with multi-output audio
Allow signal path routing, effects, mix between audience and monitors.
Recommended Logic, Apple Mainstage, Presonus Studio One 4, Max/MSP, Pure Data, ZenAud.io ALK2, Ableton Live
</p>

<p>
MIDI controller
</p>
</div>
</div>

<div id="outline-container-org5f85c71" class="outline-3">
<h3 id="org5f85c71">Appearances</h3>
<div class="outline-text-3" id="text-org5f85c71">
<p>
Dress cables, make computer and tech appear inconspicuous to give the impression of a musical performance, not computer exhibition
</p>
</div>
</div>

<div id="outline-container-org8fe13db" class="outline-3">
<h3 id="org8fe13db">Speaker placement</h3>
<div class="outline-text-3" id="text-org8fe13db">
<p>
At least 10 feet to each side to give stereo width. Too much separation not desireable
</p>
</div>
</div>

<div id="outline-container-orgcc75fcc" class="outline-3">
<h3 id="orgcc75fcc">Tape</h3>
<div class="outline-text-3" id="text-orgcc75fcc">
<p>
tape not as easy to perform, but easier from a tech standpoint
</p>
</div>
</div>

<div id="outline-container-org8f13a60" class="outline-3">
<h3 id="org8f13a60">Practicing</h3>
<div class="outline-text-3" id="text-org8f13a60">
<p>
Still need knowledge of the score
Drop the needle could be useful
</p>
</div>
</div>

<div id="outline-container-org3ff97a4" class="outline-3">
<h3 id="org3ff97a4">Tape first</h3>
<div class="outline-text-3" id="text-org3ff97a4">
<p>
Second recommendation to play a piece with tape first
</p>
</div>
</div>

<div id="outline-container-orga35fbac" class="outline-3">
<h3 id="orga35fbac">Computer for effects</h3>
<div class="outline-text-3" id="text-orga35fbac">
<p>
Recommends using a computer and daw for effects because of the ability to seamlessly coordinate with other pieces using computers
</p>
</div>
</div>

<div id="outline-container-org3cd9f72" class="outline-3">
<h3 id="org3cd9f72">Delay mistakes</h3>
<div class="outline-text-3" id="text-org3cd9f72">
<p>
You will hear them multiple times so accuracy is important with delay
</p>
</div>
</div>

<div id="outline-container-org9952322" class="outline-3">
<h3 id="org9952322">Max vs others</h3>
<div class="outline-text-3" id="text-org9952322">
<p>
Recommends performers learn ableton, logic, etc as they have more applications outside the performance.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
